namespace PureMarket.System;

public class Plan
{
    /*
     * 1. Норма человека в день для потребления
     * 2. Подсчет каллорий (добавить прием пищи + подсчитать по данным из БД)
     *  2.1. Есть день, неделя, месяц. Пользователь может добавлять, удалять, редактировать еду, которую он употребил
     *       за день и в какое время
     *  2.2. Все это дело будет записываться в БД и подсчитываться статистическим путем (не доел, переел, насыщен и тд)
     *  2.3. Чтобы был смысл от всего этого говна, можно поставить себе цель, например, набрать массу.
     *       И каждую неделю будет прилетать статистика с прогрессом (потенциальным, а также фактическим, который укажет пользователь)
     */
}